In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1,3,6,np.nan,44,1])
s

0     1.0
1     3.0
2     6.0
3     NaN
4    44.0
5     1.0
dtype: float64

In [5]:
dates = pd.date_range('20200401',periods=6)
dates

DatetimeIndex(['2020-04-01', '2020-04-02', '2020-04-03', '2020-04-04',
               '2020-04-05', '2020-04-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=['a','b','c','d'])
df

                   a         b         c         d
2020-04-01 -0.207466 -0.847431  0.089601 -1.498839
2020-04-02 -0.056035 -1.865678 -0.501880 -0.013320
2020-04-03 -2.331968  0.772602 -1.303549 -0.323172
2020-04-04  2.191468  0.753384  0.938077  0.190696
2020-04-05 -0.449484  1.271014 -0.641739  2.184345
2020-04-06 -0.331976  0.376111 -0.147049 -0.208568

In [9]:
df1 = pd.DataFrame(np.arange(12).reshape(3,4))
df1

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [12]:
df2 = pd.DataFrame({'A':1,
                    'B':np.array([3]*4,dtype='int64'),
                    'C':pd.Categorical(['test','train','test','train']),
                    'D':'foo'})
df2

   A  B      C    D
0  1  3   test  foo
1  1  3  train  foo
2  1  3   test  foo
3  1  3  train  foo

In [14]:
df2.dtypes

A       int64
B       int64
C    category
D      object
dtype: object

In [16]:
df2.index

RangeIndex(start=0, stop=4, step=1)

In [18]:
df2.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [19]:
df2.describe()

         A    B
count  4.0  4.0
mean   1.0  3.0
std    0.0  0.0
min    1.0  3.0
25%    1.0  3.0
50%    1.0  3.0
75%    1.0  3.0
max    1.0  3.0

In [20]:
df2.T

      0      1     2      3
A     1      1     1      1
B     3      3     3      3
C  test  train  test  train
D   foo    foo   foo    foo

In [21]:
df2.sort_index(axis=1,ascending=False)

     D      C  B  A
0  foo   test  3  1
1  foo  train  3  1
2  foo   test  3  1
3  foo  train  3  1

In [22]:
df2.sort_values(by='C')

   A  B      C    D
0  1  3   test  foo
2  1  3   test  foo
1  1  3  train  foo
3  1  3  train  foo

In [56]:
index = pd.date_range('20200401',periods=6)
col = ['A','B','C','D']
df3 = pd.DataFrame(np.arange(24).reshape(6,4),index=index,columns=col)
df3

             A   B   C   D
2020-04-01   0   1   2   3
2020-04-02   4   5   6   7
2020-04-03   8   9  10  11
2020-04-04  12  13  14  15
2020-04-05  16  17  18  19
2020-04-06  20  21  22  23

In [27]:
#print(df3['A'],df3.A)

In [28]:
df3[0:3]

            A  B   C   D
2020-04-01  0  1   2   3
2020-04-02  4  5   6   7
2020-04-03  8  9  10  11

In [29]:
print(df3['2020-04-01':'2020-04-03'])

            A  B   C   D
2020-04-01  0  1   2   3
2020-04-02  4  5   6   7
2020-04-03  8  9  10  11

In [40]:
#df3.['2020-04-01'] 报错
print(df3.loc['20200401'])

A    0
B    1
C    2
D    3
Name: 2020-04-01 00:00:00, dtype: int64

## select by label:loc

In [44]:
df3.loc[:,['A','C']]

             A   C
2020-04-01   0   2
2020-04-02   4   6
2020-04-03   8  10
2020-04-04  12  14
2020-04-05  16  18
2020-04-06  20  22

## select by position:iloc

In [41]:
df3.iloc[3,1]

13

In [46]:
df3[df3.A>8]

             A   B   C   D
2020-04-04  12  13  14  15
2020-04-05  16  17  18  19
2020-04-06  20  21  22  23

In [57]:
df3.iloc[2,2] = 111
df3

             A   B    C   D
2020-04-01   0   1    2   3
2020-04-02   4   5    6   7
2020-04-03   8   9  111  11
2020-04-04  12  13   14  15
2020-04-05  16  17   18  19
2020-04-06  20  21   22  23

In [50]:
df3.loc['2020-04-02']['B'] = 222
df3

             A    B    C   D
2020-04-01   0    1    2   3
2020-04-02   4  222    6   7
2020-04-03   8    9  111  11
2020-04-04  12   13   14  15
2020-04-05  16   17   18  19
2020-04-06  20   21   22  23

In [58]:
df3.A[df3.A>4] = 4
df3

            A   B    C   D
2020-04-01  0   1    2   3
2020-04-02  4   5    6   7
2020-04-03  4   9  111  11
2020-04-04  4  13   14  15
2020-04-05  4  17   18  19
2020-04-06  4  21   22  23

In [59]:
df3['E'] = pd.Series([1,2,3,4,5,6],index=pd.date_range('2020-04-01',periods=6))
df3

            A   B    C   D  E
2020-04-01  0   1    2   3  1
2020-04-02  4   5    6   7  2
2020-04-03  4   9  111  11  3
2020-04-04  4  13   14  15  4
2020-04-05  4  17   18  19  5
2020-04-06  4  21   22  23  6

In [63]:
df3.iloc[0,1] = np.nan
df3.iloc[1,2] = np.nan
print(df3.dropna(how='any'))

            A     B      C   D  E
2020-04-03  4   9.0  111.0  11  3
2020-04-04  4  13.0   14.0  15  4
2020-04-05  4  17.0   18.0  19  5
2020-04-06  4  21.0   22.0  23  6

In [69]:

print(df3)
print(df3.isnull())
print(np.any(df3.isnull()) == True)
print(df3.fillna(value=0))

            A     B      C   D  E
2020-04-01  0   NaN    2.0   3  1
2020-04-02  4   5.0    NaN   7  2
2020-04-03  4   9.0  111.0  11  3
2020-04-04  4  13.0   14.0  15  4
2020-04-05  4  17.0   18.0  19  5
2020-04-06  4  21.0   22.0  23  6
                A      B      C      D      E
2020-04-01  False   True  False  False  False
2020-04-02  False  False   True  False  False
2020-04-03  False  False  False  False  False
2020-04-04  False  False  False  False  False
2020-04-05  False  False  False  False  False
2020-04-06  False  False  False  False  False
True
            A     B      C   D  E
2020-04-01  0   0.0    2.0   3  1
2020-04-02  4   5.0    0.0   7  2
2020-04-03  4   9.0  111.0  11  3
2020-04-04  4  13.0   14.0  15  4
2020-04-05  4  17.0   18.0  19  5
2020-04-06  4  21.0   22.0  23  6